jcfain/TCodeESP32/ESP32/src/main.cpp
/* MIT License

Copyright (c) 2024 Jason C. Fain

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE. */

#if DEBUG_BUILD
    #define LOG_LOCAL_LEVEL ESP_LOG_DEBUG
    #include "esp_log.h"
#endif
#if BUILD_TYPE == RELEASE
#include <Arduino.h>
#endif

#if ESP8266 == 1
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266HTTPUpdateServer.h>
#include <ESP8266WebServer.h>
#endif

#include "utils.h"
#include <LittleFS.h>
#include "LogHandler.h"
#include "SettingsHandler.h"
#include "SystemCommandHandler.h"
#if WIFI_TCODE
	#include "WifiHandler.h"
#endif

#if TEMP_ENABLED
	#include "TemperatureHandler.h"
#endif
#if DISPLAY_ENABLED
	#include "DisplayHandler.h"
#endif
#if BLUETOOTH_TCODE
	#include "BluetoothHandler.h"
#endif
#include "TCode/MotorHandler.h"
//#include "BLEConfigurationHandler.h"
#if MOTOR_TYPE == 0
	#if TCODE_V2//Too much memory needed with debug
		#include "TCode/v0.2/ServoHandler0_2.h"
	#endif

	#include "TCode/v0.3/ServoHandler0_3.h"
	//#include "TCode/v1.0/ServoHandler1_0.h"
#elif MOTOR_TYPE == 1
	#include "TCode/v0.3/BLDCHandler0_3.h"
#endif

#if WIFI_TCODE
	#include "UdpHandler.h"
	//#include "TcpHandler.h"
	#include "HTTP/HTTPBase.h"
	#include "HTTP/WebSocketBase.h"
	#if !SECURE_WEB
		#include "WebHandler.h"
	#else
		#include "HTTP\HTTPSHandler.hpp"
	#endif
	#include "MDNSHandler.hpp"
#endif
//#include "OTAHandler.h"
#if BLE_TCODE
	#include "BLEHandler.hpp"
#endif

#if WIFI_TCODE
	#if !SECURE_WEB
		#include "WebSocketHandler.h"
	#else
		#include "HTTP/SecureWebSocketHandler.hpp"
	#endif
#endif

#include "BatteryHandler.h"
#include "Motion/MotionHandler.hpp"
#include "VoiceHandler.hpp"
#include "ButtonHandler.hpp"

SystemCommandHandler* systemCommandHandler;
//BLEConfigurationHandler* bleConfigurationHandler;
//TcpHandler tcpHandler;
MotorHandler* motorHandler;
BatteryHandler* batteryHandler;
TaskHandle_t batteryTask;
TaskHandle_t httpsTask;

MotionHandler motionHandler;
VoiceHandler* voiceHandler;
ButtonHandler* buttonHandler = 0;
TaskHandle_t voiceTask;
#if BLUETOOTH_TCODE
	BluetoothHandler* btHandler = 0;
#endif

#if WIFI_TCODE
	Udphandler* udpHandler = 0;
	WifiHandler wifi;
	MDNSHandler mdnsHandler;
	HTTPBase* webHandler = 0;
	WebSocketBase* webSocketHandler = 0;
#endif

#if TEMP_ENABLED
	TemperatureHandler* temperatureHandler = 0;
#endif

#if BLE_TCODE
	BLEHandler* bleHandler = 0;
#endif

#if DISPLAY_ENABLED
	DisplayHandler* displayHandler;
	TaskHandle_t displayTask;
	// #if ISAAC_NEWTONGUE_BUILD
	// 	TaskHandle_t animationTask;
	// #endif
#endif
#if TEMP_ENABLED
	TaskHandle_t temperatureTask;
#endif
// This has issues running with the webserver.
//OTAHandler otaHandler;
bool setupSucceeded = false;
bool restarting = false;

String serialData;
char commandTCodeData[MAX_COMMAND];
char udpData[MAX_COMMAND];
char webSocketData[MAX_COMMAND];
#if BLE_TCODE
	char bleData[MAX_COMMAND];
#endif
#if BLUETOOTH_TCODE
	String bluetoothData;
#endif
char movement[MAX_COMMAND];
ButtonModel* buttonCommand = 0;
bool dStopped = false;
bool tcodeV2Recieved = false;

unsigned long bench[10];
unsigned long benchLast[10];
bool benchEnable = false;
bool benchEnableZero = false;
unsigned long benchThreshHold = 1300;

void benchStart(int benchNumber) {
	if(benchEnable || (benchEnableZero && benchNumber == 0))
		bench[benchNumber] = micros();
}
void benchFinish(const char* systemUnderBench, int benchNumber) {
	if(benchEnable || (benchEnableZero && benchNumber == 0)) {
		unsigned long timeTaken = micros() - bench[benchNumber];
		if(timeTaken > benchThreshHold) {
			Serial.printf("%s:							%lu\n", systemUnderBench, timeTaken);
			bench[benchNumber] = 0;
			benchLast[benchNumber] = timeTaken;
		}
	}
}

void displayPrint(String text) {
	#if DISPLAY_ENABLED
		displayHandler->println(text);
	#endif
}


void TCodeCommandCallback(const char* in) {

	if(systemCommandHandler->isCommand(in)) {
		systemCommandHandler->process(in);
	} else {
		#if BLUETOOTH_TCODE
			if (SettingsHandler::bluetoothEnabled && btHandler && btHandler->isConnected())
				btHandler->CommandCallback(in);
		#endif
		#if BLE_TCODE

		#endif
		#if WIFI_TCODE
			if(webSocketHandler)
				webSocketHandler->CommandCallback(in);
			if(udpHandler)
				udpHandler->CommandCallback(in);
		#endif
		if(Serial)
			Serial.println(in);
	}
}
void TCodePassthroughCommandCallback(const char* in) {
	if(systemCommandHandler->isCommand(in)) {
		// This seems wrong but since we are only calling this from one place its fine for now.
		char temp[strlen(in) +2];
		temp[0] = {0};
		strcpy(temp, in);
		strcat(temp, "\n");
		//////////////////////////////////////////////////////////////////////////////////////
		#if BLUETOOTH_TCODE
			if (SettingsHandler::bluetoothEnabled && btHandler && btHandler->isConnected())
				btHandler->CommandCallback(temp);
		#endif
		#if BLE_TCODE

		#endif
		#if WIFI_TCODE
			if(webSocketHandler)
				webSocketHandler->CommandCallback(temp);
			if(udpHandler)
				udpHandler->CommandCallback(temp);
		#endif
		if(Serial)
			Serial.println(temp);
	}
}
void profileChangeCallback(uint8_t profile) {
	
