jcfain/TCodeESP32/ESP32/src/main.cpp
}
void logCallBack(const char* in, LogLevel level) {
#if WIFI_TCODE
	// if(webSocketHandler) {
	// 	webSocketHandler->sendDebug(in, level);
	// }
#endif
}
#if TEMP_ENABLED
	void tempChangeCallBack(TemperatureType type, const char* message, float temp) {
	#if WIFI_TCODE
		if(webSocketHandler) {
			if (strpbrk(message, "{") == nullptr) {
				webSocketHandler->sendCommand(message);
			} else {
				if(type == TemperatureType::SLEEVE) {
					webSocketHandler->sendCommand("sleeveTempStatus", message);
				} else {
					webSocketHandler->sendCommand("internalTempStatus", message);
				}
			}
		}
	#endif
	#if DISPLAY_ENABLED
		if(displayHandler) {
			if(type == TemperatureType::SLEEVE) {
				displayHandler->setSleeveTemp(temp);
			} else {
				displayHandler->setInternalTemp(temp);
			}
		}
	#endif
	}
	void tempStateChangeCallBack(TemperatureType type, const char* state) {
	#if DISPLAY_ENABLED
		if(displayHandler) {
			if(type == TemperatureType::SLEEVE) {
				LogHandler::verbose(TagHandler::Main, "tempStateChangeCallBack heat: %s", state);
				displayHandler->setHeateState(state);
				if(temperatureHandler)
					displayHandler->setHeateStateShort(temperatureHandler->getShortSleeveControlStatus(state));
			} else {
				LogHandler::verbose(TagHandler::Main, "tempStateChangeCallBack fan: %s", state);
				displayHandler->setFanState(state);
			}
		}
	#endif
	}
#endif
#if WIFI_TCODE
void startWeb(bool apMode) {
	if(!webHandler) {
		displayPrint("Starting web server");
		#if !SECURE_WEB
			webHandler = new WebHandler();
			webSocketHandler = new WebSocketHandler();
		#else
			webHandler = new HTTPSHandler();
			webSocketHandler = new SecureWebSocketHandler();
		#endif
		webHandler->setup(SettingsHandler::webServerPort, webSocketHandler, apMode);
		if(!apMode)
		mdnsHandler.setup(SettingsHandler::hostname, SettingsHandler::friendlyName);
		
		#if SECURE_WEB
			LogHandler::debug(TagHandler::Main, "Start https task");
			auto httpsStatus = xTaskCreateUniversal(
				HTTPSHandler::startLoop,/* Function to implement the task */
				"HTTPSTask", /* Name of the task */
				8192 * 3,  /* Stack size in words */
				webHandler,  /* Task input parameter */
				3,  /* Priority of the task */
				&httpsTask,  /* Task handle. */
				-1); /* Core where the task should run */
			if(httpsStatus != pdPASS) {
				LogHandler::error(TagHandler::Main, "Could not start https task.");
			}
		#endif
	}
}
#endif

void startBLEConfig() {
	// if(!bleConfigurationHandler) {
	// 	displayPrint("Starting BLE config");
	// 	bleConfigurationHandler = new BLEConfigurationHandler();
	// 	bleConfigurationHandler->setup();
	// }
}

#if BLE_TCODE
void startBLE() {
	if(!bleHandler) {
		displayPrint("Starting BLE");
		bleHandler = new BLEHandler();
		bleHandler->setup();
	}
}
#endif

#if BLUETOOTH_TCODE
void startBlueTooth() {
	if(!btHandler) {
		displayPrint("Starting Bluetooth serial");
		btHandler = new BluetoothHandler();
		btHandler->setup();
	}
}
#endif

#if WIFI_TCODE
void startUDP() {
	if(!udpHandler) {
		displayPrint("Starting UDP");
		udpHandler = new Udphandler();
		udpHandler->setup(SettingsHandler::udpServerPort);
	}
}
#endif

#if WIFI_TCODE
void startConfigMode(bool withBle= true) {
	SettingsHandler::apMode = true;
	LogHandler::info(TagHandler::Main, "Starting in APMode");
	displayPrint("Starting in APMode");
	if (wifi.startAp()) 
	{
		LogHandler::info(TagHandler::Main, "APMode started");
		displayPrint("APMode started");
		startWeb(true);
	}
	else 
	{
		LogHandler::error(TagHandler::Main, "APMode start failed");
		displayPrint("APMode start failed");
	}

// After attempting to connect wifi, ble cause crash
	if(withBle) { 
		startBLEConfig();
	}
}
#endif

#if WIFI_TCODE
void wifiStatusCallBack(WiFiStatus status, WiFiReason reason) {
	if(status == WiFiStatus::CONNECTED) {
        LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiStatus::CONNECTED");
		if(reason == WiFiReason::AP_MODE) {
        	LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::AP_MODE");
            // if(bleConfigurationHandler)
            //   bleConfigurationHandler->stop(); // If a client connects to the ap stop the BLE to save memory.
		}
	} else {
		// wifi.dispose();
		// startApMode();
        LogHandler::debug(TagHandler::Main, "wifiStatusCallBack Not connected");
		if(reason == WiFiReason::NO_AP || reason == WiFiReason::UNKNOWN) {
        	LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::NO_AP || WiFiReason::UNKNOWN");
			startConfigMode(false);
		} else if(reason == WiFiReason::AUTH) {
        	LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::AUTH");
            LogHandler::warning(TagHandler::Main, "Connection auth failed: Resetting wifi password and restarting");
            strcpy(SettingsHandler::wifiPass, SettingsHandler::defaultWifiPass);
            SettingsHandler::saveSettings();
            ESP.restart();
		}  else if(reason == WiFiReason::AP_MODE) {
        	LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::AP_MODE");
			// #if !ESP32_DA
			// if(bleConfigurationHandler)
			// 	bleConfigurationHandler->setup();
			// #endif
		}
	}
}
#endif

void batteryVoltageCallback(float capacityRemainingPercentage, float capacityRemaining, float voltage, float temperature) {
	#if DISPLAY_ENABLED
		if(displayHandler) {
			displayHandler->setBatteryInformation(capacityRemainingPercentage, voltage, temperature);
		}
	#endif
	#if WIFI_TCODE
		if(webSocketHandler) {
			String statusJson("{\"batteryCapacityRemaining\":\"" + String(capacityRemaining) + "\", \"batteryCapacityRemainingPercentage\":\"" + String(capacityRemainingPercentage) + "\", \"batteryVoltage\":\""+String(voltage)+"\", \"batteryTemperature\":\""+String(temperature)+"\"}");
			webSocketHandler->sendCommand("batteryStatus", statusJson.c_str());
		}
	#endif
}

void settingChangeCallback(const char* group, const char* settingThatChanged) {
    LogHandler::debug(TagHandler::Main, "settingChangeCallback: %s", settingThatChanged);
	if(strcmp(group, "motionGenerator") == 0) {
		if(strcmp(settingThatChanged, "motionSelectedProfileIndex") == 0 || strcmp(settingThatChanged, "motionProfile") == 0) 
			motionHandler.setMotionChannels(SettingsHandler::getMotionChannels());
		// else if(strcmp(settingThatChanged, "motionChannels") == 0) 
		// 	motionHandler.setMotionChannels(SettingsHandler::getMotionChannels());
		else if(strcmp(settingThatChanged, "motionEnabled") == 0) 
			motionHandler.setEnabled(SettingsHandler::getMotionEnabled());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobal") == 0) 
		// 	motionHandler.setAmplitude(SettingsHandler::getMotionAmplitudeGlobal());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobal") == 0) 
		// 	motionHandler.setOffset(SettingsHandler::getMotionOffsetGlobal());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobal") == 0) 
		// 	motionHandler.setPeriod(SettingsHandler::getMotionPeriodGlobal());
		// else if(strcmp(settingThatChanged, "motionUpdateGlobal") == 0) 
		// 	motionHandler.setUpdate(SettingsHandler::getMotionUpdateGlobal());
		// else if(strcmp(settingThatChanged, "motionPhaseGlobal") == 0) 
		// 	motionHandler.setPhase(SettingsHandler::getMotionPhaseGlobal());
		// else if(strcmp(settingThatChanged, "motionReversedGlobal") == 0) 
		// 	motionHandler.setReverse(SettingsHandler::getMotionReversedGlobal());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobalRandom") == 0) 
		// 	motionHandler.setAmplitudeRandom(SettingsHandler::getMotionAmplitudeGlobalRandom());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobalRandomMin") == 0) 
		// 	motionHandler.setAmplitudeRandomMin(SettingsHandler::getMotionAmplitudeGlobalRandomMin());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobalRandomMax") == 0) 
		// 	motionHandler.setAmplitudeRandomMax(SettingsHandler::getMotionAmplitudeGlobalRandomMax());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobalRandom") == 0) 
		// 	motionHandler.setPeriodRandom(SettingsHandler::getMotionPeriodGlobalRandom());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobalRandomMin") == 0) 
		// 	motionHandler.setPeriodRandomMin(SettingsHandler::getMotionPeriodGlobalRandomMin());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobalRandomMax") == 0) 
		// 	motionHandler.setPeriodRandomMax(SettingsHandler::getMotionPeriodGlobalRandomMax());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobalRandom") == 0) 
		// 	motionHandler.setOffsetRandom(SettingsHandler::getMotionOffsetGlobalRandom());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobalRandomMin") == 0) 
		// 	motionHandler.setOffsetRandomMin(SettingsHandler::getMotionOffsetGlobalRandomMin());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobalRandomMax") == 0) 
		// 	motionHandler.setOffsetRandomMax(SettingsHandler::getMotionOffsetGlobalRandomMax());
		// else if(strcmp(settingThatChanged, "motionRandomChangeMin") == 0) 
		// 	motionHandler.setMotionRandomChangeMin(SettingsHandler::getMotionRandomChangeMin());
		// else if(strcmp(settingThatChanged, "motionRandomChangeMax") == 0) 
		// 	motionHandler.setMotionRandomChangeMax(SettingsHandler::getMotionRandomChangeMax());
	} else if(voiceHandler && strcmp(group, "voiceHandler") == 0) {
		if(strcmp(settingThatChanged, "voiceMuted") == 0) 
			voiceHandler->setMuteMode(SettingsHandler::getVoiceMuted());
		else if(strcmp(settingThatChanged, "voiceVolume") == 0) 
			voiceHandler->setVolume(SettingsHandler::getVoiceVolume());
		else if(strcmp(settingThatChanged, "voiceWakeTime") == 0) 
			voiceHandler->setWakeTime(SettingsHandler::getVoiceWakeTime());
	} else if(buttonHandler && strcmp(group, "buttonCommand") == 0) {
		if(strcmp(settingThatChanged, "bootButtonCommand") == 0) 
			buttonHandler->updateBootButtonCommand(SettingsHandler::bootButtonCommand);
		else if(strcmp(settingThatChanged, "analogButtonCommands") == 0) {
			buttonHandler->updateAnalogButtonCommands(SettingsHandler::buttonSets);
		} else if(strcmp(settingThatChanged, "buttonAnalogDebounce") == 0) {
			buttonHandler->updateAnalogDebounce(SettingsHandler::buttonAnalogDebounce);
		}
	} else if(strcmp(group, "channelRanges") == 0) {// TODO add channe; specific updates when moving to its own save...maybe...
		motionHandler.updateChannelRanges();
	}
	
	
