jcfain/TCodeESP32/ESP32/src/main.cpp
}
void loadI2CModules() {
#if DISPLAY_ENABLED
	if(SettingsHandler::displayEnabled)
	{
    	LogHandler::debug(TagHandler::Main, "Start Display task");
		auto displayStatus = xTaskCreatePinnedToCore(
			DisplayHandler::startLoop,/* Function to implement the task */
			"DisplayTask", /* Name of the task */
			5000,  /* Stack size in words */
			displayHandler,  /* Task input parameter */
			1,  /* Priority of the task */
			&displayTask,  /* Task handle. */
			APP_CPU_NUM); /* Core where the task should run */
			if(displayStatus != pdPASS) {
    			LogHandler::error(TagHandler::Main, "Could not start display task.");
			}
	}
#endif
	if(SettingsHandler::batteryLevelEnabled) {
		batteryHandler = new BatteryHandler();
		if(batteryHandler->setup()) {
			LogHandler::debug(TagHandler::Main, "Start Battery task");
			auto batteryStatus = xTaskCreatePinnedToCore(
				BatteryHandler::startLoop,/* Function to implement the task */
				"BatteryTask", /* Name of the task */
				4028,  /* Stack size in words */
				batteryHandler,  /* Task input parameter */
				1,  /* Priority of the task */
				&batteryTask,  /* Task handle. */
				APP_CPU_NUM); /* Core where the task should run */
				if(batteryStatus != pdPASS) {
					LogHandler::error(TagHandler::Main, "Could not start battery task.");
				}
				batteryHandler->setMessageCallback(batteryVoltageCallback);
		}
	}
	if(SettingsHandler::getVoiceEnabled()) {
		voiceHandler = new VoiceHandler();
		voiceHandler->setMessageCallback(TCodeCommandCallback);
		if(voiceHandler->setup()) {
			LogHandler::debug(TagHandler::Main, "Start Voice task");
			auto voiceStatus = xTaskCreatePinnedToCore(
				VoiceHandler::startLoop,/* Function to implement the task */
				"VoiceTask", /* Name of the task */
				4028,  /* Stack size in words */
				voiceHandler,  /* Task input parameter */
				1,  /* Priority of the task */
				&voiceTask,  /* Task handle. */
				APP_CPU_NUM); /* Core where the task should run */
				if(voiceStatus != pdPASS) {
					LogHandler::error(TagHandler::Main, "Could not start voice task.");
				}
		}
	}
}
void setup() 
{
	// see if we can use the onboard led for status
	//https://github.com/kriswiner/ESP32/blob/master/PWM/ledcWrite_demo_ESP32.ino
  	//digitalWrite(5, LOW);// Turn off on-board blue led


	Serial.begin(115200);
	
    LogHandler::setLogLevel(LogLevel::INFO);
	LogHandler::setMessageCallback(logCallBack);
	#if WIFI_TCODE
		wifi.setWiFiStatusCallback(wifiStatusCallBack);
	#endif

	uint32_t chipId = 0;
	for(int i=0; i<17; i=i+8) {
	  chipId |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
	}
	Serial.println();
	LogHandler::info(TagHandler::Main, "ESP32 Chip model = %s Rev %d\n", ESP.getChipModel(), ESP.getChipRevision());
	LogHandler::info(TagHandler::Main, "This chip has %d cores\n", ESP.getChipCores());
 	LogHandler::info(TagHandler::Main, "Chip ID: %u\n", chipId);

    // esp_log_level_set("*", ESP_LOG_VERBOSE);
	// LogHandler::debug("main", "this is verbose");
	// LogHandler::debug("main", "this is debug");
	// LogHandler::info("main", "this is info");
	// LogHandler::warning("main", "this is warning");
	// LogHandler::error("main", "this is error");

	if(!LittleFS.begin(true))
	{
		LogHandler::error(TagHandler::Main, "An Error has occurred while mounting LittleFS");
		setupSucceeded = false;
		return;
	}

	SettingsHandler::init();
	LogHandler::info(TagHandler::Main, "Version: %s", SettingsHandler::getFirmwareVersion());

	systemCommandHandler = new SystemCommandHandler();
	systemCommandHandler->registerExternalCommandCallback(TCodePassthroughCommandCallback);

#if MOTOR_TYPE == 0
	if(SettingsHandler::TCodeVersionEnum == TCodeVersion::v0_3) {
		motorHandler = new ServoHandler0_3();
	}
	#if !DEBUG_BUILD && TCODE_V2
		else if(SettingsHandler::TCodeVersionEnum == TCodeVersion::v0_2)
			motorHandler = new ServoHandler0_2();
	#endif
		else {
			LogHandler::error(TagHandler::Main, "Invalid TCode version: %ld", SettingsHandler::TCodeVersionEnum);
			return;// TODO: this stops apmode and not what we want
			//motorHandler = new ServoHandler1_0();
		}
#elif MOTOR_TYPE == 1
	motorHandler = new BLDCHandler0_3();
#else
	LogHandler::error(TagHandler::Main, "Invalid motor type defined!");
	return;
#endif

	motorHandler->setMessageCallback(TCodeCommandCallback);
	//SystemCommandHandler::registerOtherCommandCallback(TCodeCommandCallback);

#if TEMP_ENABLED
	if(SettingsHandler::tempSleeveEnabled || SettingsHandler::tempInternalEnabled) {
		temperatureHandler = new TemperatureHandler();
		temperatureHandler->setup();
		temperatureHandler->setMessageCallback(tempChangeCallBack);
		temperatureHandler->setStateChangeCallback(tempStateChangeCallBack);
    	LogHandler::debug(TagHandler::Main, "Start temperature task");
		auto tempStartStatus = xTaskCreatePinnedToCore(
			TemperatureHandler::startLoop,/* Function to implement the task */
			"TempTask", /* Name of the task */
			5000,  /* Stack size in words */
			temperatureHandler,  /* Task input parameter */
			1,  /* Priority of the task */
			&temperatureTask,  /* Task handle. */
			APP_CPU_NUM); /* Core where the task should run */
		if(tempStartStatus != pdPASS) {
			LogHandler::error(TagHandler::Main, "Could not start temperature task.");
		}
	}
	
#endif
#if DISPLAY_ENABLED
	displayHandler = new DisplayHandler();
	if(SettingsHandler::displayEnabled)
	{
		displayHandler->setup();
		// #if ISAAC_NEWTONGUE_BUILD
		// 	xTaskCreatePinnedToCore(
		// 		DisplayHandler::startAnimationDontPanic,/* Function to implement the task */
		// 		"DisplayTask", /* Name of the task */
		// 		10000,  /* Stack size in words */
		// 		displayHandler,  /* Task input parameter */
		// 		25,  /* Priority of the task */
		// 		&animationTask,  /* Task handle. */
		// 		APP_CPU_NUM); /* Core where the task should run */
		// #endif
	}
#endif

	
	#if WIFI_TCODE
		if (strcmp(SettingsHandler::wifiPass, SettingsHandler::defaultWifiPass) != 0 && SettingsHandler::ssid != nullptr) {
			displayPrint("Setting up wifi...");
			displayPrint("Connecting to: ");
			displayPrint(SettingsHandler::ssid);
			if (wifi.connect(SettingsHandler::ssid, SettingsHandler::wifiPass)) { 
				displayPrint("Connected IP: " + wifi.ip().toString());
		#if DISPLAY_ENABLED
			displayHandler->setLocalIPAddress(wifi.ip());
		#endif
				startUDP();
				startWeb(false);
			} 
		} else {
			startConfigMode();
		}
	#endif
	#if BLUETOOTH_TCODE
		if(!SettingsHandler::apMode && SettingsHandler::bluetoothEnabled) {
			startBlueTooth();
		} 
	#endif

	#if BLE_TCODE
		startBLE();
	#endif
    //otaHandler.setup();
	displayPrint("Setting up motor");
    motorHandler->setup();
	motionHandler.setup(SettingsHandler::TCodeVersionEnum);
	loadI2CModules();
	
	if(SettingsHandler::bootButtonEnabled || SettingsHandler::buttonSetsEnabled) {
		buttonHandler = new ButtonHandler();
		buttonHandler->init(SettingsHandler::buttonAnalogDebounce, SettingsHandler::bootButtonCommand, SettingsHandler::buttonSets);
	}

	SettingsHandler::setMessageCallback(settingChangeCallback);
	setupSucceeded = true;
    LogHandler::debug(TagHandler::Main, "Setup finished");
    SettingsHandler::printFree();
}

