jcfain/TCodeESP32/ESP32/src/main.cpp
// Main loop functions/////////////////////////////////////////////////
void readTCode(String& tcode) {
	if(SettingsHandler::TCodeVersionEnum == TCodeVersion::v0_2)
		tcodeV2Recieved = true;
	if(motorHandler) {
		motorHandler->read(tcode);
		tcode.clear();
	}
}

void readTCode(char* tcode) {
	if(SettingsHandler::TCodeVersionEnum == TCodeVersion::v0_2)
		tcodeV2Recieved = true;
	if(motorHandler) {
		motorHandler->read(tcode);
		tcode[0] = {0};
	}
}

void processButton() {
	if(buttonHandler) {
		buttonHandler->read(buttonCommand);
		if(buttonCommand) {
			char command[MAX_COMMAND];
			systemCommandHandler->process(buttonCommand, command);
			if(strlen(command) > 0) {
				readTCode(command);
			}
		}
	}
}

void getTCodeInput() {
	if(Serial.available() > 0) {
		serialData = Serial.readStringUntil('\n');
	} else if(serialData.length()) {
		serialData.clear();
	}
	if(systemCommandHandler) {
		systemCommandHandler->getTCode(commandTCodeData);
	}
#if BLUETOOTH_TCODE
	if (btHandler && btHandler->isConnected() && btHandler->available() > 0) {
		bluetoothData = btHandler->readStringUntil('\n');
	}
#endif
#if WIFI_TCODE
	if(webSocketHandler) {
		benchStart(1);
		webSocketHandler->getTCode(webSocketData);
		benchFinish("Websocket get", 1);
	}
	if(udpHandler) {
		benchStart(2);
		udpHandler->read(udpData);
		benchFinish("Udp get", 2);
	}
#endif
#if BLE_TCODE
	if(bleHandler) {
		bleHandler->read(bleData);
	}
#endif
}

void processCommand() {
	// Read and process tcode $ and # commands
	if(serialData.length() > 0) {
		if(systemCommandHandler && systemCommandHandler->isCommand(serialData.c_str())) {
			//systemCommandHandler->process(serialData.c_str());
			readTCode(serialData);
		}
	}
#if BLUETOOTH_TCODE
	if(bluetoothData.length() > 0) {
		if(systemCommandHandler && systemCommandHandler->isCommand(bluetoothData.c_str())) {
			//systemCommandHandler->process(bluetoothData.c_str());
			executeTCode(bluetoothData);
		}
	}
#endif
#if WIFI_TCODE
	else if(strlen(udpData) > 0 && systemCommandHandler && systemCommandHandler->isCommand(udpData)) {
		//systemCommandHandler->process(udpData);
		readTCode(udpData);
	}
	else if(strlen(webSocketData) > 0 && systemCommandHandler && systemCommandHandler->isCommand(webSocketData)) {
		//systemCommandHandler->process(webSocketData);
		readTCode(webSocketData);
	}
#endif
}

void processMotionHandlerMovement() {
	motionHandler.getMovement(movement);
	if(strlen(movement) > 0) {
		LogHandler::verbose(TagHandler::MainLoop, "motion handler writing: %s", movement);
		readTCode(movement);
	}
}

void loop() {
	// if(setupSucceeded && SettingsHandler::saving) {
	// 	motorHandler->execute();
	// 	vTaskDelay(250/portTICK_PERIOD_MS);
	// 	return;
	// }
	//LogHandler::verbose(TagHandler::MainLoop, "Enter loop ############################################");
	tcodeV2Recieved = false;
	benchStart(0);
	if (SettingsHandler::restartRequired || restarting) {  // check the flag here to determine if a restart is required
		if(!restarting) {
			LogHandler::info(TagHandler::Main, "Restarting ESP");
			ESP.restart();
        	restarting = true;
		}
        vTaskDelay(1000/portTICK_PERIOD_MS);
	} 
#if TEMP_ENABLED
	else if (SettingsHandler::tempInternalEnabled && temperatureHandler && temperatureHandler->isMaxTempTriggered()) {
		char stop[7] = "DSTOP\n";
		readTCode(stop);
		LogHandler::error(TagHandler::Main, "Internal temp has reached maximum user set. Main loop disabled! Restart system to enable the loop.");
			if(SettingsHandler::fanControlEnabled) {
				temperatureHandler->setFanState();
			}
        vTaskDelay(5000/portTICK_PERIOD_MS);
	} 
#endif
	else {
		if(setupSucceeded)
		{
			//otaHandler.handle();

			getTCodeInput();// Must be executed first!
			
			processButton();

			processCommand();

			if(!SettingsHandler::motionPaused) {
				dStopped = false;
				benchStart(3);
				if (SettingsHandler::getMotionEnabled()) {// Motion overrides all other input
					processMotionHandlerMovement();
				} else if (strlen(commandTCodeData) > 0) {
					LogHandler::verbose(TagHandler::MainLoop, "system command tcode writing: %s", commandTCodeData);
					readTCode(commandTCodeData);
				} else if (serialData.length() > 0) {
					LogHandler::verbose(TagHandler::MainLoop, "serial writing: %s", serialData.c_str());
					readTCode(serialData);
#if WIFI_TCODE == 1
				} else if (strlen(webSocketData) > 0) {
					LogHandler::verbose(TagHandler::MainLoop, "webSocket writing: %s", webSocketData);
					readTCode(webSocketData);
				} else if (!SettingsHandler::apMode && strlen(udpData) > 0) {
					benchStart(6);
					LogHandler::verbose(TagHandler::MainLoop, "udp writing: %s", udpData);
					readTCode(udpData);
					benchFinish("Udp write", 6);
#endif
#if BLE_TCODE
				} else if (strlen(bleData) > 0) {
					LogHandler::verbose(TagHandler::MainLoop, "BLE writing: %s", bleData);
					readTCode(bleData);
#endif
#if BLUETOOTH_TCODE
				} else if (!SettingsHandler::getMotionEnabled() && bluetoothData.length() > 0) {
					LogHandler::verbose(TagHandler::MainLoop, "bluetooth writing: %s", bluetoothData);
					readTCode(bluetoothData);
#endif
				}
				benchFinish("Input check", 3);
			} else if(!dStopped) {//All motion is paused execute stop.
				// movement[0] = {0};
				// udpData[0] = {0};
				// webSocketData[0] = {0};
				// serialData.clear();
				char stop[7] = "DSTOP\n";
				readTCode(stop);
				dStopped = true;
				tcodeV2Recieved = false;
#if BLE_TCODE
				//bleData = {0};
#endif
#if BLUETOOTH_TCODE
				//bluetoothData.clear();
#endif
			}

			benchStart(4);
			if(motorHandler)
				motorHandler->execute();
			benchFinish("Execute", 4);

#if TEMP_ENABLED
			benchStart(5);
			if(temperatureHandler && temperatureHandler->isRunning()) {
				if(SettingsHandler::tempSleeveEnabled) {
					temperatureHandler->setHeaterState();
				}
				if(SettingsHandler::fanControlEnabled) {
					temperatureHandler->setFanState();
				}
			}
			benchFinish("Temp check", 5);
#endif
		}
	}
	if(!setupSucceeded) {
		LogHandler::error(TagHandler::Main, "There was an issue in setup");
        vTaskDelay(5000/portTICK_PERIOD_MS);
	}
	
	benchFinish("Main loop", 0);
}